tests/load_tests/hey/get_hey_n_requests/get_300_requests.txt
****************************************************************
hey -n 300 -m GET http://127.0.0.1:8080/v1/airports/5
****************************************************************

Summary:
  Total:	1.2390 secs
  Slowest:	0.5289 secs
  Fastest:	0.0041 secs
  Average:	0.1739 secs
  Requests/sec:	242.1394
  
  Total data:	16500 bytes
  Size/request:	55 bytes

Response time histogram:
  0.004 [1]	|■
  0.057 [46]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.109 [51]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.162 [55]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.214 [34]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  0.267 [45]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.319 [46]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.371 [6]	|■■■■
  0.424 [8]	|■■■■■■
  0.476 [4]	|■■■
  0.529 [4]	|■■■


Latency distribution:
  10% in 0.0419 secs
  25% in 0.0832 secs
  50% in 0.1575 secs
  75% in 0.2594 secs
  90% in 0.2972 secs
  95% in 0.3909 secs
  99% in 0.4918 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0018 secs, 0.0041 secs, 0.5289 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0005 secs, 0.0000 secs, 0.0163 secs
  resp wait:	0.1714 secs, 0.0040 secs, 0.5287 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0154 secs

Status code distribution:
  [200]	300 responses